; domain
(define (domain exploration)
    (:requirements :strips :typing :equality :action-costs)
    
    (:types
        robot location - object
    )

    (:predicates
        (at ?r - robot ?l - location)
        (explored ?l - location)
        (can-observe ?r - robot ?l - location)
        (can-traverse ?r - robot ?l - location)
        (adjacent ?l1 - location ?l2 - location)
    )

    (:functions
        (total-cost)
        (traverse-cost ?r - robot ?l - location)
    )

    (:action move
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (adjacent ?from ?to)
            (can-traverse ?r ?to)
        )
        :effect (and
            (not (at ?r ?from))
            (at ?r ?to)
            (increase (total-cost) (traverse-cost ?r ?to))
        )
    )
    (:action observe
        :parameters (?r - robot ?l - location)
        :precondition (and
            (at ?r ?l)
            (can-observe ?r ?l)
        )
        :effect (explored ?l)
    )
)

; problem
(define (problem e1)
    (:domain exploration)
    
    (:objects
        B G - robot
        l13 l23 l33
        l12 l22 l32
        l11 l21 l31 - location
    )

    (:init
        ;; Robot starting positions
        (at B l11)
        (at G l11)

        ;; Adjacency (4-connected grid)
        (adjacent l11 l12) (adjacent l12 l11)
        (adjacent l12 l13) (adjacent l13 l12)
        (adjacent l11 l21) (adjacent l21 l11)
        (adjacent l12 l22) (adjacent l22 l12)
        (adjacent l13 l23) (adjacent l23 l13)
        (adjacent l21 l22) (adjacent l22 l21)
        (adjacent l22 l23) (adjacent l23 l22)
        (adjacent l21 l31) (adjacent l31 l21)
        (adjacent l22 l32) (adjacent l32 l22)
        (adjacent l23 l33) (adjacent l33 l23)
        (adjacent l31 l32) (adjacent l32 l31)
        (adjacent l32 l33) (adjacent l33 l32)

        ;; Traversability
        (can-traverse B l11) (can-traverse G l11)
        (can-traverse B l12) ; only B
        (can-traverse B l13) (can-traverse G l13)
        (can-traverse B l21) (can-traverse G l21)
        (can-traverse B l22) (can-traverse G l22) ; both with difficulty
        (can-traverse B l23) (can-traverse G l23)
        (can-traverse B l31) (can-traverse G l31)
        (can-traverse B l32) (can-traverse G l32)
        (can-traverse B l33) (can-traverse G l33)

        ;; Observation capabilities
        (can-observe B l11) (can-observe G l11)
        (can-observe B l12) (can-observe G l12)
        (can-observe B l13) (can-observe G l13)
        (can-observe B l21) (can-observe G l21)
        (can-observe B l22) (can-observe G l22)
        (can-observe G l23) ; only G
        (can-observe B l31) ; only B
        (can-observe B l32) (can-observe G l32)
        (can-observe B l33) (can-observe G l33)

        ;; Traverse cost: default 1, except higher for l22
        (= (traverse-cost B l11) 1)
        (= (traverse-cost G l11) 1)
        (= (traverse-cost B l12) 1)
        (= (traverse-cost B l13) 1)
        (= (traverse-cost G l13) 1)
        (= (traverse-cost B l21) 1)
        (= (traverse-cost G l21) 1)
        (= (traverse-cost B l22) 5)
        (= (traverse-cost G l22) 5)
        (= (traverse-cost B l23) 1)
        (= (traverse-cost G l23) 1)
        (= (traverse-cost B l31) 1)
        (= (traverse-cost G l31) 1)
        (= (traverse-cost B l32) 1)
        (= (traverse-cost G l32) 1)
        (= (traverse-cost B l33) 1)
        (= (traverse-cost G l33) 1)

        (= (total-cost) 0)
    )

    (:goal (and
        ;; All regions explored
        (explored l11) (explored l21) (explored l31)
        (explored l12) (explored l22) (explored l32)
        (explored l13) (explored l23) (explored l33)
        ;; Both robots at goal
        (at B l33)
        (at G l33)
    ))

    (:metric minimize (total-cost))
)

; plan
1. (move g l11 l21)
   deleted: (at g l11)
   added: (at g l21)
   goals met: 0 of 11
2. (move g l21 l22)
   deleted: (at g l21)
   added: (at g l22)
   goals met: 0 of 11
3. (move b l11 l12)
   deleted: (at b l11)
   added: (at b l12)
   goals met: 0 of 11
4. (observe g l22)
   added: (explored l22)
   goals met: 1 of 11
5. (move g l22 l23)
   deleted: (at g l22)
   added: (at g l23)
   goals met: 1 of 11
6. (move g l23 l33)
   deleted: (at g l23)
   added: (at g l33)
   goals met: 2 of 11
7. (observe b l12)
   added: (explored l12)
   goals met: 3 of 11
8. (move b l12 l11)
   deleted: (at b l12)
   added: (at b l11)
   goals met: 3 of 11
9. (observe b l11)
   added: (explored l11)
   goals met: 4 of 11
10. (move b l11 l21)
   deleted: (at b l11)
   added: (at b l21)
   goals met: 4 of 11
11. (observe b l21)
   added: (explored l21)
   goals met: 5 of 11
12. (move b l21 l31)
   deleted: (at b l21)
   added: (at b l31)
   goals met: 5 of 11
13. (observe g l33)
   added: (explored l33)
   goals met: 6 of 11
14. (move g l33 l23)
   deleted: (at g l33)
   added: (at g l23)
   goals met: 5 of 11
15. (observe b l31)
   added: (explored l31)
   goals met: 6 of 11
16. (move b l31 l32)
   deleted: (at b l31)
   added: (at b l32)
   goals met: 6 of 11
17. (observe b l32)
   added: (explored l32)
   goals met: 7 of 11
18. (move b l32 l33)
   deleted: (at b l32)
   added: (at b l33)
   goals met: 8 of 11
19. (observe g l23)
   added: (explored l23)
   goals met: 9 of 11
20. (move g l23 l13)
   deleted: (at g l23)
   added: (at g l13)
   goals met: 9 of 11
21. (observe g l13)
   added: (explored l13)
   goals met: 10 of 11
22. (move g l13 l23)
   deleted: (at g l13)
   added: (at g l23)
   goals met: 10 of 11
23. (move g l23 l33)
   deleted: (at g l23)
   added: (at g l33)
   goals met: 11 of 11
